In [1]:
import pandas as pd

In [34]:
pd.set_option("display.max_colwidth", None)

# Load data

In [4]:
df = pd.read_csv("data/adult.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [5]:
df.head(5)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

## 1. How many men and women (sex feature) are represented in this dataset?

In [6]:
df['gender'].value_counts()

Male      32650
Female    16192
Name: gender, dtype: int64

## 2. What is the average age (age feature) of women?

In [8]:
df[df['gender'] == 'Female']['age'].mean()

36.92798913043478

## 3. What is the percentage of German citizens (native-country feature)?

In [11]:
df['native-country'].value_counts(normalize=True)

United-States                 0.897424
Mexico                        0.019471
?                             0.017546
Philippines                   0.006040
Germany                       0.004218
Puerto-Rico                   0.003767
Canada                        0.003726
El-Salvador                   0.003173
India                         0.003092
Cuba                          0.002825
England                       0.002600
China                         0.002498
South                         0.002355
Jamaica                       0.002170
Italy                         0.002150
Dominican-Republic            0.002109
Japan                         0.001884
Guatemala                     0.001802
Poland                        0.001781
Vietnam                       0.001761
Columbia                      0.001740
Haiti                         0.001536
Portugal                      0.001372
Taiwan                        0.001331
Iran                          0.001208
Greece                        0.001003
Nicaragua                     0.001003
Peru                          0.000942
Ecuador                       0.000921
France                        0.000778
Ireland                       0.000758
Hong                          0.000614
Thailand                      0.000614
Cambodia                      0.000573
Trinadad&Tobago               0.000553
Yugoslavia                    0.000471
Laos                          0.000471
Outlying-US(Guam-USVI-etc)    0.000471
Scotland                      0.000430
Honduras                      0.000409
Hungary                       0.000389
Holand-Netherlands            0.000020
Name: native-country, dtype: float64

## 4-5. What are the mean and standard deviation of age for those who earn more than 50K per year (salary feature) and those who earn less than 50K per year?

In [16]:
df.groupby(by=['income'])['age'].describe()

          count       mean        std   min   25%   50%   75%   max
income
<=50K   37155.0  36.872184  14.104118  17.0  25.0  34.0  46.0  90.0
>50K    11687.0  44.275178  10.558983  19.0  36.0  43.0  51.0  90.0

## 6. Is it true that people who earn more than 50K have at least high school education? (education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)

In [19]:
df[df['income'] =='>50K']['education'].value_counts()

Bachelors       3313
HS-grad         2503
Some-college    2063
Masters         1459
Prof-school      617
Assoc-voc        522
Doctorate        431
Assoc-acdm       413
11th              92
10th              87
7th-8th           62
12th              48
9th               41
5th-6th           27
1st-4th            8
Preschool          1
Name: education, dtype: int64

## 7. Display age statistics for each race (race feature) and each gender (sex feature). Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race

In [20]:
df.groupby(by=['race', 'gender'])['age'].describe()

                             count       mean        std   min   25%   50%  \
race               gender
Amer-Indian-Eskimo Female    185.0  36.237838  12.840056  17.0  26.0  35.0
                   Male      285.0  36.989474  11.703943  17.0  29.0  35.0
Asian-Pac-Islander Female    517.0  35.657640  12.637799  17.0  25.0  34.0
                   Male     1002.0  38.994012  12.824878  18.0  29.0  37.0
Black              Female   2308.0  37.905979  12.736001  17.0  28.0  36.0
                   Male     2377.0  37.922592  13.036981  17.0  28.0  36.0
Other              Female    155.0  31.212903  11.233061  17.0  23.0  29.0
                   Male      251.0  35.167331  11.808297  17.0  26.0  32.0
White              Female  13027.0  36.882935  14.454178  17.0  25.0  35.0
                   Male    28735.0  39.704507  13.475250  17.0  29.0  38.0

                            75%   max
race               gender
Amer-Indian-Eskimo Female  46.0  80.0
                   Male    44.0  82.0
Asian-Pac-Islander Female  44.0  81.0
                   Male    46.0  90.0
Black              Female  46.0  90.0
                   Male    46.0  90.0
Other              Female  37.0  74.0
                   Male    42.5  77.0
White              Female  47.0  90.0
                   Male    49.0  90.0

## 8. Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-status feature)? Consider as married those who have a marital-status starting with Married (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.

In [21]:
df['marital-status'].unique()

array(['Never-married', 'Married-civ-spouse', 'Widowed', 'Divorced',
       'Separated', 'Married-spouse-absent', 'Married-AF-spouse'],
      dtype=object)

In [23]:
d = {'Married-civ-spouse' : 'married',
    'Married-spouse-absent' : 'married',
    'Married-AF-spouse' : 'married',
    'Never-married' : 'single',
    'Widowed' : 'single',
    'Divorced' : 'single', 
    'Separated' : 'single'}
df['committed-update'] = df['marital-status'].map(d)

In [25]:
df.groupby(by=['committed-update'])['income'].value_counts()

committed-update  income
married           <=50K     12988
                  >50K      10056
single            <=50K     24167
                  >50K       1631
Name: income, dtype: int64

## 9. What is the maximum number of hours a person works per week (hours-per-week feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?

In [26]:
df['hours-per-week'].max()

99

In [29]:
len(df[df['hours-per-week'] == 99])

137

In [31]:
df[df['hours-per-week'] == 99]['income'].value_counts(normalize=True)

<=50K    0.70073
>50K     0.29927
Name: income, dtype: float64

## 10. Count the average time of work (hours-per-week) for those who earn a little and a lot (salary) for each country (native-country). What will these be for Japan?

In [39]:
df.groupby(by=['native-country','income'])['hours-per-week'].describe()

                         count       mean        std   min   25%   50%   75%  \
native-country income
?              <=50K     637.0  39.552590  12.526794   1.0  40.0  40.0  40.0
               >50K      220.0  45.318182  10.993923   8.0  40.0  40.0  50.0
Cambodia       <=50K      19.0  41.157895   2.672143  40.0  40.0  40.0  40.0
               >50K        9.0  43.888889  11.666667  40.0  40.0  40.0  40.0
Canada         <=50K     119.0  37.378151  14.188795   5.0  30.0  40.0  40.0
...                        ...        ...        ...   ...   ...   ...   ...
United-States  >50K    10694.0  45.471853  11.107010   1.0  40.0  40.0  50.0
Vietnam        <=50K      79.0  37.848101  12.414930   1.0  40.0  40.0  40.0
               >50K        7.0  39.428571   1.511858  36.0  40.0  40.0  40.0
Yugoslavia     <=50K      15.0  38.533333  14.485789   8.0  40.0  40.0  42.5
               >50K        8.0  43.375000  16.809330  10.0  40.0  40.0  54.0

                        max
native-country income
?              <=50K   99.0
               >50K    80.0
Cambodia       <=50K   50.0
               >50K    75.0
Canada         <=50K   72.0
...                     ...
United-States  >50K    99.0
Vietnam        <=50K   84.0
               >50K    40.0
Yugoslavia     <=50K   66.0
               >50K    65.0

[83 rows x 8 columns]

In [42]:
df[df['native-country'] == 'Japan'].groupby(by=['income'])['hours-per-week'].describe()

        count       mean        std   min   25%   50%   75%   max
income
<=50K    60.0  39.733333  11.420865   1.0  40.0  40.0  40.5  65.0
>50K     32.0  47.062500  14.784337  21.0  40.0  45.0  50.0  99.0